# my_profile.py
import streamlit as st
import pandas as pd

st.title('자기소개')

# 본인 정보 수정하기!
st.write('## 기본 정보')
st.write('**이름**: 박성준')
st.write('**학과**: 인공지능소프트웨어학과')
st.write('**학년**: 3학년')

st.write('---')  # 구분선

st.write('## 이번 학기 시간표')
schedule = pd.DataFrame({
    '요일': ['월', '화', '수', '목', '금'],
    '2교시': ['-', '-', '-', '-', '자연어처리'],
    '3교시': ['-', '-', '-', '-', '자연어처리'],
    '4교시': ['-', '-', '-', '-', '자연어처리'], 
    '6교시': ['-', '인공지능캡스톤 디자인', '-', '-', '빅데이터분석프로젝트'],
    '7교시': ['-', '인공지능캡스톤 디자인', '-', '-', '빅데이터분석프로젝트'],
    '8교시': ['-', '인공지능캡스톤 디자인', '-', '-', '빅데이터분석프로젝트'], 
    '9교시': ['-', '인공지능캡스톤 디자인', '-', '-', '-']
})
st.write(schedule)

st.write('---')

st.write('## 관심 분야')
st.write('- AI')
st.write('- 피아노')
st.write('- 지식 탐구')

st.write('---')

st.write('## 이번 학기 목표')
goals = pd.DataFrame({
    '목표': ['학점 4.0 이상', '프로젝트 완성', '영어 공부'],
    '달성률': [0, 3, 7]
})
st.write(goals)
st.bar_chart(goals.set_index('목표'))
